app/controllers/transactions_controller.rb

  def new
    @transaction = Transaction.new
    @user = User.all
---
SELECT "users".* FROM "users"

  def create
    @transaction = Transaction.create(transaction_params)
    if @transaction.amount != nil || @transaction.quotation != nil
      @transaction.save
---
INSERT INTO "transactions" ("amount", "currency", "transaction_type", "created_at", "updated_at", "quotation") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 111.0], ["currency", "real"], ["transaction_type", "buy"], ["created_at", "2018-12-30 17:53:36.088031"], ["updated_at", "2018-12-30 17:53:36.088031"], ["quotation", 2.2]]
INSERT INTO "transactions" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-12-14 14:28:35.765395"], ["updated_at", "2018-12-14 14:28:35.765395"]]

  def show
    @user = User.find(params[:id])
    @transaction = Transaction.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @transaction = Transaction.find(params[:id])
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @transaction = Transaction.find(params[:id])
    if @transaction.valid?
      @transaction.update(transaction_params)
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "transactions" SET "amount" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["amount", 3.0], ["updated_at", "2019-01-10 00:29:16.418869"], ["id", 1]]

  def destroy
    @transaction = Transaction.find(params[:id])
    @transaction.destroy
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "transactions" WHERE "transactions"."id" = ?  [["id", 1]]