app/views/transactions/edit.html.erb

SELECT "users".* FROM "users"
---
  <%= form.label :user_id, 'Usuário' %>
  <%= form.collection_select(:user_id, User.all, :id, :email) %>