app/views/transactions/new.html.erb

  <%= form.label :user_id, 'Usuário' %>
  <%= form.collection_select(:user_id, User.all, :id, :email) %>
---
SELECT "users".* FROM "users"